{
  "es": {
    "menu_about": "Sobre mí",
    "menu_experience": "Experiencia",
    "menu_projects": "Proyectos",
    "about_intro": "Frontend Developer con experiencia profesional en <strong>React</strong> y <strong>TypeScript</strong>, especializado en desarrollo de aplicaciones web, creación de interfaces modernas, consumo de APIs REST y trabajo en entornos reales de producción. He participado en el desarrollo completo del frontend de una aplicación de facturación conforme a normativa <strong>VERI*FACTU</strong>, colaborando con equipos técnicos y mejorando la calidad del código y la experiencia de usuario.<br><br>Busco una posición frontend donde seguir aportando valor técnico y crecer profesionalmente.<br><br><strong>Formación:</strong> Desarrollo de Aplicaciones Web (FP) | IES Las Fuentezuelas, Jaén, España (2021-2024)<br><strong>Idiomas:</strong> Inglés B2<br><strong>Otros:</strong> Permiso de conducir B y A2, disponibilidad horaria total<br><strong>Contacto:</strong> +34 655438222 | alejandro.sanjim2000@gmail.com",
    "experience_reindal_title": "Reindal",
    "experience_reindal_subtitle": "Prácticas como desarrollador web",
    "experience_reindal_date": "Marzo 2024 - Junio 2024",
    "experience_reindal_description": "Desarrollo y mantenimiento de aplicaciones web. Trabajo internacional usando inglés (ocasionalmente italiano). Adaptación a nuevas tecnologías y metodologías. Colaboración en equipo y resolución de incidencias técnicas.",
    "experience_unita_title": "Unita",
    "experience_unita_subtitle": "Frontend Developer",
    "experience_unita_date": "Febrero 2025 - Actualidad",
    "experience_unita_description": "Desarrollo completo del frontend de una aplicación de facturación conforme a normativa <strong>VERI*FACTU</strong>. Implementación de interfaces y componentes reutilizables con React y TypeScript, consumo de APIs REST, creación de pantallas, formularios y flujos de usuario. Colaboración con backend y soporte funcional.",
    "project_neosif_title": "Neosif",
    "project_neosif_subtitle": "Proyecto profesional en desarrollo",
    "project_neosif_date": "2025",
    "project_neosif_description": "Neosif es una aplicación web profesional enfocada en la normativa <strong>VERI*FACTU</strong>, desarrollada en <strong>React JS</strong>. Utiliza más de 40 componentes reutilizables y gestiona más de 50 clientes con sus empleados. Desarrollo en entorno profesional manteniendo confidencialidad.",
    "project_socialmoto_title": "SocialMoto",
    "project_socialmoto_subtitle": "Red social para moteros",
    "project_socialmoto_date": "2024",
    "project_socialmoto_description": "SocialMoto es una red social para moteros con publicaciones, notificaciones, mensajes privados y rutas. Trabajo individual con Symfony, JavaScript y MySQL, con Bootstrap y Docker. Actualmente inactivo por falta de tiempo.",
    "project_parkly_title": "Parkly",
    "project_parkly_subtitle": "App móvil para gestionar parkings de moto",
    "project_parkly_date": "2024",
    "project_parkly_description": "Parkly es una app móvil para localizar parkings, reservar plazas y gestionar pagos. Desarrollada con React Native y Firebase. Actualmente parada por falta de tiempo."
  },
  "en": {
    "menu_about": "About Me",
    "menu_experience": "Experience",
    "menu_projects": "Projects",
    "about_intro": "Frontend Developer with professional experience in <strong>React</strong> and <strong>TypeScript</strong>, specialized in web application development, modern UI creation, REST API consumption, and real production environments. I participated in the complete frontend development of a billing application compliant with <strong>VERI*FACTU</strong> regulations, collaborating with technical teams and improving code quality and user experience.<br><br>I am seeking a frontend position to continue contributing technically and grow professionally.<br><br><strong>Education:</strong> Web Application Development (FP) | IES Las Fuentezuelas, Jaén, Spain (2021-2024)<br><strong>Languages:</strong> English B2<br><strong>Other:</strong> Driving license B and A2, full availability<br><strong>Contact:</strong> +34 655438222 | alejandro.sanjim2000@gmail.com",
    "experience_reindal_title": "Reindal",
    "experience_reindal_subtitle": "Web Developer Internship",
    "experience_reindal_date": "March 2024 - June 2024",
    "experience_reindal_description": "Development and maintenance of web applications. International work using English (occasionally Italian). Adaptation to new technologies and methodologies. Team collaboration and resolution of technical issues.",
    "experience_unita_title": "Unita",
    "experience_unita_subtitle": "Frontend Developer",
    "experience_unita_date": "February 2025 - Present",
    "experience_unita_description": "Complete frontend development of a billing application compliant with <strong>VERI*FACTU</strong> regulations. Implementation of reusable interfaces and components with React and TypeScript, REST API consumption, creation of screens, forms, and user flows. Collaboration with backend and functional support.",
    "project_neosif_title": "Neosif",
    "project_neosif_subtitle": "Professional development project",
    "project_neosif_date": "2025",
    "project_neosif_description": "Neosif is a professional web application focused on <strong>VERI*FACTU</strong> regulations, developed in <strong>React JS</strong>. Uses more than 40 reusable components and manages over 50 clients with their employees. Developed in a professional environment while maintaining confidentiality.",
    "project_socialmoto_title": "SocialMoto",
    "project_socialmoto_subtitle": "Motorbike Social Network",
    "project_socialmoto_date": "2024",
    "project_socialmoto_description": "SocialMoto is a social network for motorbike enthusiasts with posts, notifications, private messages, and routes. Individual work with Symfony, JavaScript, and MySQL, with Bootstrap and Docker. Currently inactive due to lack of time.",
    "project_parkly_title": "Parkly",
    "project_parkly_subtitle": "Mobile app for managing motorcycle parking",
    "project_parkly_date": "2024",
    "project_parkly_description": "Parkly is a mobile app for locating parking spots, reserving spaces, and managing payments. Developed with React Native and Firebase. Currently paused due to lack of time."
  }
}
