{
    "es": {
        "title": "Alejandro Sánchez",
        "developer_title": "Desarrollador Web",
        "menu_about": "Sobre mí",
        "menu_experience": "Experiencia",
        "menu_projects": "Proyectos",
        "about_intro": "Soy técnico en desarrollo web formado en el IES Las Fuentezuelas de Jaén. A lo largo de mi trayectoria he adquirido experiencia en diversos lenguajes de programación, tales como <span class=\"fw-bold\">PHP</span>, <span class=\"fw-bold\">JavaScript</span>, <span class=\"fw-bold\">Python</span> y <span class=\"fw-bold\">Java</span>. He trabajado principalmente con los frameworks <span class=\"fw-bold\">Symfony</span> y <span class=\"fw-bold\">Angular</span>, y tengo un buen manejo de bases de datos como <span class=\"fw-bold\">MySQL</span> y <span class=\"fw-bold\">SQLDeveloper</span>. Además, me siento cómodo utilizando herramientas como <span class=\"fw-bold\">Docker</span> y <span class=\"fw-bold\">Git</span> en mi flujo de trabajo diario.\n\nHace un año, decidí comenzar mis estudios en <span class=\"fw-bold\">Ingeniería Informática</span> con la intención de completar el grado a largo plazo, a un ritmo de pocas asignaturas por año. Estoy convencido de que la combinación de mis estudios y experiencia práctica me permitirá seguir creciendo como desarrollador.\n\nActualmente me encuentro buscando mi primer empleo en el área del desarrollo web, con el objetivo de poner en práctica todo lo aprendido, mejorar mis habilidades y aprender de la experiencia y conocimientos de mis compañeros.\n\nEn cuanto a mis intereses personales, me gusta hacer deporte, leer y disfrutar del tiempo libre con amigos. Además, siempre me ha apasionado la tecnología, por lo que trato de mantenerme al tanto de las últimas novedades y avances en el sector.",
        "experience_reindal_title": "Reindal",
        "experience_reindal_subtitle": "Prácticas de desarrollador web",
        "experience_reindal_date": "Marzo 2024 - Junio 2024",
        "experience_reindal_description": "Prácticas en la empresa Reindal, ubicada en Italia, como culminación de mi formación superior en Desarrollo de Aplicaciones Web (DAW). Durante esta experiencia, tengo la oportunidad de sumergirme en un entorno laboral internacional, lo que me permite desarrollar mis habilidades de comunicación en inglés y adquirir un nivel básico de italiano. Además de fortalecer mis habilidades como desarrollador, estoy aprendiendo la importancia del trabajo en equipo y la capacidad de adaptarme a nuevas tecnologías.",
        "experience_karl_title": "Karl-Nahrgang-Schule",
        "experience_karl_subtitle": "Prácticas de ayudante de profesor",
        "experience_karl_date": "Abril 2017",
        "experience_karl_description": "Prácticas realizadas en la escuela Karl-Nahrgang de Dreieich, Alemania, organizadas por el instituto Santa Catalina de Alejandría y el Heinrich-Heine-Schule. Durante ese tiempo practiqué el alemán mientras aprendía el tipo de enseñanza que se aplica en un país como Alemania. La atención escolar incluye 120 niños a ser atendidos en horario principal de 11.30 a 17.00 horas.",
        "project_socialmoto_title": "SocialMoto",
        "project_socialmoto_subtitle": "Red social para moteros",
        "project_socialmoto_date": "2024",
        "project_socialmoto_description": "SocialMoto nació de la necesidad de realizar un proyecto final, el concepto básico es una red social donde puedes publicar comentarios y pensamientos y que tu círculo de amigos puedan participar en estos. Cuenta con búsqueda de amigos y publicaciones, notificaciones, mensajes privados y personalización de perfil. Además tienes la posibilidad de grabar tus propias rutas.<br><br>Este proyecto es un trabajo individual realizado en <strong>Symfony</strong>, <strong>JavaScript</strong> y <strong>MySQL</strong>. Además, cuenta con <strong>Bootstrap</strong> para facilitar el diseño, el control de versiones se ha realizado en <strong>GitHub</strong> y todo está almacenado en contenedores <strong>Docker</strong> para un mejor manejo."
    },
    "en": {
        "title": "Alejandro Sánchez",
        "developer_title": "Web Developer",
        "menu_about": "About Me",
        "menu_experience": "Experience",
        "menu_projects": "Projects",
        "about_intro": "I am a web development technician trained at IES Las Fuentezuelas in Jaén. Throughout my career, I have gained experience in various programming languages, such as <span class=\"fw-bold\">PHP</span>, <span class=\"fw-bold\">JavaScript</span>, <span class=\"fw-bold\">Python</span>, and <span class=\"fw-bold\">Java</span>. I have primarily worked with the <span class=\"fw-bold\">Symfony</span> and <span class=\"fw-bold\">Angular</span> frameworks, and I have good knowledge of databases such as <span class=\"fw-bold\">MySQL</span> and <span class=\"fw-bold\">SQLDeveloper</span>. Additionally, I am comfortable using tools like <span class=\"fw-bold\">Docker</span> and <span class=\"fw-bold\">Git</span> in my daily workflow.\n\nA year ago, I decided to start my studies in <span class=\"fw-bold\">Computer Engineering</span> with the intention of completing the degree over time, taking a few subjects per year. I am convinced that the combination of my studies and practical experience will allow me to continue growing as a developer.\n\nCurrently, I am looking for my first job in the web development field, with the goal of putting everything I've learned into practice, improving my skills, and learning from the experience and knowledge of my colleagues.\n\nAs for my personal interests, I enjoy playing sports, reading, and spending free time with friends. Also, I have always been passionate about technology, so I try to stay up to date with the latest trends and advancements in the field.",
        "experience_reindal_title": "Reindal",
        "experience_reindal_subtitle": "Web Developer Internship",
        "experience_reindal_date": "March 2024 - June 2024",
        "experience_reindal_description": "Internship at the company Reindal, located in Italy, as the culmination of my higher education in Web Application Development (DAW). During this experience, I had the opportunity to immerse myself in an international work environment, which allowed me to develop my communication skills in English and acquire a basic level of Italian. In addition to strengthening my skills as a developer, I am learning the importance of teamwork and the ability to adapt to new technologies.",
        "experience_karl_title": "Karl-Nahrgang-Schule",
        "experience_karl_subtitle": "Teaching Assistant Internship",
        "experience_karl_date": "April 2017",
        "experience_karl_description": "Internship at the Karl-Nahrgang School in Dreieich, Germany, organized by the Santa Catalina de Alejandría Institute and the Heinrich-Heine-Schule. During this time, I practiced German while learning about the type of education system applied in a country like Germany. The school provides care for 120 children, with the main hours of operation from 11:30 AM to 5:00 PM.",
        "project_socialmoto_title": "SocialMoto",
        "project_socialmoto_subtitle": "Motorbike Social Network",
        "project_socialmoto_date": "2024",
        "project_socialmoto_description": "SocialMoto was born out of the need to create a final project. The basic concept is a social network where you can post comments and thoughts, and your circle of friends can participate in these. It includes friend and post search, notifications, private messages, and profile customization. Additionally, you have the possibility to record your own routes.<br><br>This project is an individual work done in <strong>Symfony</strong>, <strong>JavaScript</strong>, and <strong>MySQL</strong>. It also uses <strong>Bootstrap</strong> to facilitate design, version control has been done in <strong>GitHub</strong>, and everything is stored in <strong>Docker</strong> containers for better management."
    }
}
